[
    {
        "artist": "Andy Shauf",
        "song name": "The Magician",
        "lyrics": "15 ContributorsThe Magician Lyrics[Verse 1]\nDo you find it gets a little easier\nEach time you make it disappear?\nOh fools, the magician bends the rules\nAs the crowd watches his every move\n\n[Chorus]\nJust a shaking hand without a concrete plan\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\n\n[Verse 2]\nSidesteps to a death-defying feat\nWait for him to reappear\nLook close, you'll see him sweat the most\nEach time his options disappear\n\n[Chorus]\nJust a shaking hand without a concrete plan\nJust a shaking hand without a concrete plan\nI’m a shaking hand without a plan\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nSee Andy Shauf LiveGet tickets as low as $42You might also like[Outro]\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo\nDoo doo doo doo, doo doo doo4Embed"
    },
    {
        "artist": "Andy Shauf",
        "song name": "Quite Like You",
        "lyrics": "14 ContributorsQuite Like You LyricsJeremy's so stoned I'd be surprised\nIf he saw the tears in Sherry's eyes\nShe's standing in the corner staring at the floor\nI wonder what the hell he did this time\n\nNormally, I wouldn't care to be so bold\nTonight, I think I'll ask her what is wrong\nShe seems a bit embarrassed and I understand\nI say,\"I wish that you were having a good time.\"\n\nShe says \"You know I've never really met someone like you.\"\n\"You know I've never really met someone like you.\"\n\nI'm not one to speak up but I've had a few\nSo I start cutting Jeremy right in two\nI say, \"I don't know what you see in him. It seems to me\nAll he ever does is bring you down.\"\n\nI'm spilling my drink as I really start\nTearing one of my best friends apart\nShe's getting uneasy and my drunken speech\nEnds as my hand finds its way to hers\nI say, \"You know I've never really met someone like you.\"\n\"You know I've never really met someone like you.\"\nSee Andy Shauf LiveGet tickets as low as $42You might also likeJeremy walks over and, to my surprise\nSherry puts her arm around his side2Embed"
    },
    {
        "artist": "Andy Shauf",
        "song name": "To You",
        "lyrics": "25 ContributorsTo You LyricsJeremy, can we talk a minute?\nI've got some things that I need to\nGet off of my chest\n\nI know that we've had a few\nAnd it's far too late\nBut if I wait, I might never tell you\nCan we find somewhere quiet?\nLet's go outside\nI've got some smokes if you've got a light\nIt's just that sometimes when I'm by your side\nIt feels so right\nIt feels like nothing could go wrong\nDoes it ever\nFeel like that to you?\nDoes it ever\nFeel like that to you?\nOh, I don't know what I mean\nIt sounded wrong and I'm just tired\nNot being weird\nI just mean that you're a good friend\nIt's hard to explain\nJust forget I said anything\nSee Andy Shauf LiveGet tickets as low as $42You might also likeGet over yourself\nI'm not in love with you\nIt just came out all wrong\nYeah\nTell the guys and laugh it up\nWhy am I even surprised?\nThat it never\nFeels like that to you\nThat it never\nFeels like that to you\nI guess it never\nFeels like that to you\nI guess it never\nFeels like that to youEmbed"
    }
]