[
    {
        "artist": "​s_connoisseur",
        "song name": "Best Tracks of 2016",
        "lyrics": "Now come the songs - ten, unordered. Each artist is limited to a single spot on the list, though I don't imagine that actually restricted choice. Kanye may have fared better were he allowed more spots, but in the interest of diversity let's keep it to one song per artist. These are my favourite 10 songs of 2016.The Avalanches - \"If I Was A Folkstar\"The Avalanches always seem to create pieces that are part-tune, part-soundscape. Each song seems to inhabit a space, often determined by background conversations and other diagetic sounds. This song is a great example of this trademark sound. “If I Was A Folkstar” opens with the sounds of flicking through radio stations as the car tears down a highway, the trip to the world the song inhabits. Interwoven in Wildflower’s continuous narrative, “If I Was A Folkstar” feels like an acid flashback to a beach bonfire, equal parts ethereal and warm.\n\nToro y Moi is the perfect guest, with his airy voice and indie image merging with the carefree, loop-driven instrumentation. A standout track on a standout album.Frank Ocean - \"Seigfried\"Blonde is an exceptional album, and “Seigfried” is arguably the best track. It’s not as accessible as otherwise outstanding cuts like “Nikes,” “Pink + White” or “Self Control,” but it packs an emotional punch unfelt elsewhere on the album. Seemingly drawing from his relationship with Willy Cartier, Ocean combines gorgeous vocals, fragile lyrics, spoken word poetry and delicate echoes to craft one of the most interesting and earnest tracks of 2016. He even interpolates the late Elliott Smith. Everything about “Seigfried” sounds like heartbreak - the lyrics, the voice behind them and the empty echo the underpins it all.Bon Iver - \"8 (circle)\"“8 (circle)” is one of the most standard tracks on Bon Iver’s experimental third LP, 22, A Million, which goes to show the true value of well-crafted convention. The track evokes the same feeling as Bon Iver album closer “Beth/Rest,” mostly due to their similar ambient backing. Though structurally conventional, it’s still packed with complex sounds and gorgeous vocal harmonies. Vernon’s near-indecipherable lyrics do little to clarify the intent, his voice more an instrument than any force of narrative. Despite this, two lines stand out from the rest:I’m standing on the street now\nAnd I carry his guitar…\"8 (circle)\" lacks the creative sampling found elsewhere on the LP, though it's not any stronger or weaker for it. It's merely a different kind of beautiful.Kanye West - \"Ultralight Beam\"As an unabashed Kanye devotee, I had a few issues with The Life Of Pablo. That having been said, one of the best musical moments I’ve had all year was the first time I sat down to listen to the album.\n\nI went to watch Yeezy Season 3 at a cinema, and the showing was at something like 8 in the morning. A ticketing problem put me on my own, sitting in the middle of an empty row. Kanye walked into Madison Square Garden, and the cinema was abuzz with speculation – was it really going to be a gospel album? What kind of features would we be getting? Then “Ultralight Beam” came on, and Chance gave one of the best verses of the year, and for a good six minutes I was totally entranced. I'll admit that it's hard to pick 'best songs' from Kanye's extensive catalogue, but this is undoubtedly one of his most epic and touching tracks.Radiohead - \"Decks Dark\"The third track on A Moon Shaped Pool, “Decks Dark” is a microcosm of 2016 Radiohead. It’s got an intriguing beat, Thom Yorke’s signature vocals, a backing choir, a fluid but strange tonal shift, a crunchy outro guitar and Jonny Greenwood’s orchestral flairs. It’s the most dynamic song on the album, beating out brilliant mood tracks such as “Daydreaming” and “True Love Waits” with lurching paranoia and dense instrumentation.Shura - \"What Happened To Us?\"Shura’s Nothing’s Real is built around the kind of inner-city heartbreak that’s truly unexceptional. She plays this as a strength, taking a relatable, modern fare and infusing it with synthpop stylings and the most poetically simple lyrics. On “What Happened To Us?” she sings:I was never ready for your love\nNo, I'm no child but I don't feel grown up...“What Happened To Us?” feels like the product of a band, which is at odds with the rest of her debut. It’s a drum driven, guitar-laced cry of regret that’s unfairly relegated to an album track. Though understandable when held next to her pop-centric singles, “What Happened To Us?” makes this list as a mature and catchy throwback to 80’s alternative.Francis And The Lights - \"Friends\"Before it was masterfully sampled on Chance the Rapper’s “Summer Friends,” Francis and the Lights’ Bon Iver-featuring single was a track caught somewhere between Chance’s own wistful happiness and James Blake’s brand of electro-singer-songwriter.\n\n\"Friends\" is a beautiful electro-R&B jam about breakups, with Francis and Justin Vernon pledging to work through hardships and stay friends with their lovers. The lyrics are layered over a pulsing synth, which gives way to delicately layered harmonies in the gorgeous outro. It's hard to explain - 'an upbeat kind of ethereal' is the best I can manage.Noname - \"Diddy Bop\"“Diddy Bop” is Noname stretching her legs. Confined to the cages of guest spots for years, most notably alongside Chance The Rapper and Kirk Knight, she’s had many well-used chances to show us her skillset. 2016’s Telefone is a unique, beachy mix of chilled out hip-hop and smooth hooks, and “Diddy Bop” has the smoothest of them all.\n\nNoname shines alongside Raury and Cam O’bi, comfortably beating out her guest stars despite providing them ample opportunity to unseat her. “Diddy Bop” is the story of her childhood, undoubtedly her ride from start to finish. The beat is engaging; the flow ever-interesting. A lyrical tour of a 90s childhood, Noname references juking, Raz-B, After School Matters and the titular Diddy Bop. She tells stories in pithy statements -  the time she got caught stealing cash from her mum, the times she stayed out past curfew, even the time she got \"caught with the blunt\" in a parking lot. It's acrobatic, down-to-earth storytelling.DJ Khaled - \"Nas Album Done\"This is the first year I really delved into hip hop, and I still only have a toe in the ocean. One of the first classic albums I checked out was Nas' Illmatic, which instantly became one of my favourite albums. Admittedly, Illmatic is as much a moment in time as it is an album, but Nas has since dropped a variety of projects that have failed to garner similar reception. \"Nas Album Done\" sounds new, topical and tight. I honestly think it's one of my favourite Nas tracks.\n\n\"Nas Album Done\" is Nas' show, no matter how many ad libs DJ Khaled throws out in the intro. Maybe the tightest lyrics I've heard all year, this track is a powerful affirmation of Nas' legendary status. He addresses economic inequality and his ever-growing legacy, even managing to turn some Khaled meme-phrases into a brief hook. It's also an insanely compelling album trailer - if this is what Nas decided to throw on someone else's record, I'm really excited to see what he's kept for himself.The Weeknd - \"I Feel It Coming\"Easily the best single on Starboy, \"I Feel It Coming\" is an MJ-esque dance-ballad. A uniquely earnest track from the usually-promiscuous Weeknd, it's a perfect way to close out an album I found to be largely disappointing.\n\nDaft Punk's feature is beautiful, their production easily identifiable and their vocals a highlight. It's not merely a Daft Punk anchored admiration, however, as lead single \"Starboy\" left me feeling a little cold. This is a great song for the end of the night out, and a great song for romance. It's not overly cheesy or clichéd, despite the clearly indebted sound. It's the way love songs should be done.2Embed"
    },
    {
        "artist": "Elliott Smith",
        "song name": "Between the Bars",
        "lyrics": "[Verse 1]\nDrink up, baby, stay up all night\nWith the things you could do, you won't but you might\nThe potential you'll be, that you'll never see\nThe promises you'll only make\nDrink up with me now and forget all about\nThe pressure of days, do what I say\nAnd I'll make you okay and drive them away\nThe images stuck in your head\n\n[Chorus]\nPeople you've been before that you\nDon't want around anymore\nThat push and shove and won't bend to your will\nI'll keep them still\n\n[Verse 2]\nDrink up, baby, look at the stars\nI'll kiss you again, between the bars\nWhere I'm seeing you there, with your hands in the air\nWaiting to finally be caught\nDrink up one more time and I'll make you mine\nKeep you apart, deep in my heart\nSeparate from the rest, where I like you the best\nAnd keep the things you forgot\nYou might also like[Chorus]\nThe people you've been before that you\nDon't want around anymore\nThat push and shove and won't bend to your will\nI'll keep them still79Embed"
    },
    {
        "artist": "Elliott Smith",
        "song name": "Say Yes",
        "lyrics": "[Verse 1]\nI'm in love with the world\nThrough the eyes of a girl\nWho's still around the morning after\nWe broke up a month ago\nAnd I grew up, I didn't know\nI'd be around the morning after\n\n[Verse 2]\nIt's always been wait and see\nA happy day and then you pay\nAnd feel like shit the morning after\nBut now I feel changed around\nAnd instead of falling down\nI'm standing up the morning after\n\n[Bridge]\nSituations get fucked up\nAnd turned around sooner or later\nAnd I could be another fool\nOr an exception to the rule\nYou tell me the morning after\n\n[Chorus]\nCrooked spin can't come to rest\nI'm damaged bad at best\nShe'll decide what she wants\nI'll probably be the last to know\nNo one says until it shows, see how it is\nThey want you or they don't\nSay yes\nYou might also like[Outro]\nI'm in love with the world\nThrough the eyes of a girl\nWho's still around the morning after26Embed"
    },
    {
        "artist": "Elliott Smith",
        "song name": "Needle in the Hay",
        "lyrics": "[Verse 1]\nYour hand on his arm\nHaystack charm around your neck\nStrung out and thin\nCalling some friend, trying to cash some check\nHe's acting dumb\nThat's what you've come to expect\n\n[Chorus]\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\n\n[Verse 2]\nHe's wearing your clothes\nHead down to toes a reaction to you\nYou say you know what he did\nBut you idiot kid\nYou don't have a clue\nSometimes they just get caught in the eye\nYou're pulling him through\n\n[Chorus]\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nYou might also like[Verse 3]\nNow on the bus\nNearly touching this dirty retreat\nFalling out\n6th and Powell, a dead sweat in my teeth\nGonna walk, walk, walk\nFour more blocks plus the one in my brain\nDown downstairs to the man\nHe's gonna make it all okay\nI can't be myself\nI can't be myself and I don't want to talk\nI'm taking the cure so I can be quiet wherever I want\nSo leave me alone\nYou ought to be proud that I'm getting good marks\n\n[Chorus]\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay\nNeedle in the hay16Embed"
    },
    {
        "artist": "Elliott Smith",
        "song name": "Waltz #2 (XO)",
        "lyrics": "[Verse 1]\nFirst the mic, then a half cigarette\nSinging \"Cathy's Clown\"\nThat's the man she's married to now\nThat's the girl that he takes around town\nShe appears composed, so she is, I suppose\nWho can really tell?\nShe shows no emotion at all\nStares into space like a dead china doll\n\n[Chorus]\nI'm never gonna know you now\nBut I'm gonna love you anyhow\n\n[Verse 2]\nNow she's done and they're calling someone\nSuch a familiar name\nI'm so glad that my memory's remote\n'Cause I'm doing just fine hour to hour, note to note\nHere it is, the revenge to the tune\n\"You're no good\nYou're no good, you're no good, you're no good\"\nCan't you tell that it's well understood?\n\n[Chorus]\nI'm never gonna know you now\nBut I'm gonna love you anyhow\nYou might also like[Bridge]\nI'm here today and expected to stay on and on and on\nI'm tired, I'm tired\n\n[Verse 3]\nLooking out on the substitute scene\nStill going strong\nXO, Mom\nIt's okay, it's all right, nothing's wrong\nTell Mr. Man with impossible plans to just leave me alone\nIn the place where I make no mistakes\nIn the place where I have what it takes\n\n[Chorus]\nI'm never gonna know you now\nBut I'm gonna love you anyhow\nI'm never gonna know you now\nBut I'm gonna love you anyhow\nI'm never gonna know you now\nBut I'm gonna love you anyhow26Embed"
    },
    {
        "artist": "Elliott Smith",
        "song name": "Angeles",
        "lyrics": "[Verse 1]\nSomeone's always coming around here, trailing some new kill\nSays, \"I've seen your picture on a hundred dollar bill\"\nWhat's a game of chance to you, to him is one of real skill\n\n[Chorus]\nSo glad to meet you\nAngeles\n\n[Verse 2]\nPicking up the ticket shows there's money to be made\nGo on, lose the gamble that's the history of the trade\nDid you add up all the cards left to play to zero\n\n[Chorus 2]\nAnd sign up with evil\nAngeles?\n\n{Bridge}\nDon't start me trying now\nUh-huh, uh-huh, uh-huh\n\n{Chorus 3}\n'Cause I'm all over it\nAngeles\nYou might also like[Verse 3]\nI can make you satisfied in everything you do\nAll your secret wishes could right now be coming true\nAnd be forever with my poison arms around you\n\n[Chorus 4]\nNo one's gonna fool around with us\nNo one's gonna fool around with us\nSo glad to meet you\nAngeles15Embed"
    }
]