[
    {
        "artist": "​demxntia",
        "song name": "​she knows",
        "text": "[Verse 1]\nTake me back to the days of our adolescence\nSkipping class everyday never learned my lesson\nI was walking back home on these roads fulla holes\nWith the wind passing by feeling cold\nYeah that was the night that we met at first\nWould we still talk in a few years? I wasn't sure\nIt didn't mean much cause of how young we were\nNow I'm biting my tongue at the thought of her\nI wish that my feelings were fake\nBut I felt pain when she said his name\nAnd I know that my feelings ain't fake\nCause I go insane, when I hear his name\nShe sayin' she fine but I know that she's tired\nIt's funny cause I know that she ain't the greatest liar\nShe seems to glow brighter at times that I dim\nGuess I can't beat conversations with him but\n\n[Pre-Chorus]\nShe could do better\nAnd I know it\nYeah\nAyy if you listenin'\nJust know\nThat you can do better\nAnd you know it\nLemme ask you\nYou might also like[Chorus]\nSo why you still fuckin' with lames girl\nYou know he's not in your lane girl\nKnow I won't do you the same girl\nSeein' you drives me insane girl\nDoes he make you laugh in the same way?\nWhen he's on the phone, ain't it dull and grey?\nYou havin' more fun when you with me babe\nDo you feel content, or is it just okay?\n\nTell me why you still fuckin' with lames girl\nYou know he's not in your lane girl\nKnow I won't do you the same girl\nSeein' you drives me insane girl\nDoes he make you laugh in the same way?\nWhen he's on the phone, ain't it dull and grey?\nAre you havin' more fun when you with me babe?\nDo you feel content, or is it just okay?\n\n[Verse 2]\nDon't settle for less when you know you the best\nBe true to yourself is my only request\nI already know you not easily impressed\nI ain't mean to hurt feelin's but I must express\nThat he ain't worth your time there's no need to be stressed\nI love every time that you rockin' your dress you a blessin'\nYeah I can do anything he can\nAnd I can do everything he can't\n[Bridge]\nYou can do better\nAnd you know it babe (and you know it babe)\nYou could do it better\nAnd you know it babe\n\nOne more time\n\n[Chorus]\nSo why you still fuckin' with lames girl\nYou know he's not in your lane girl\nKnow I won't do you the same girl\nSeein' you drives me insane girl\nDoes he make you laugh in the same way?\nWhen he's on the phone, ain't it dull and grey?\nYou havin' more fun when you with me babe\nDo you feel content, or is it just okay?\n\nTell me why you still fuckin' with lames girl\nYou know he's not in your lane girl\nKnow I won't do you the same girl\nSeein' you drives me insane girl\nDoes he make you laugh in the same way?\nWhen he's on the phone, ain't it dull and grey?\nAre you havin' more fun when you with me babe?\nDo you feel content, or is it just okay?\nTell me why you still fuckin' with lames girl\nYou know he's not in your lane girl\nKnow I won't do you the same girl\nSeein' you drives me insane girl\nDoes he make you laugh in the same way?\nWhen he's on the phone, ain't it dull and grey?\nAre you havin' more fun5Embed"
    },
    {
        "artist": "DMX",
        "song name": "Where the Hood At?",
        "text": "[Intro]\n(Now I gotta deal with this shit)\nAyy, yo, y'all niggas must be out your fuckin' mind (Yo, yo, old shitty-dick ass niggas)\nThinking dog can't pull another motherfuckin' rabbit out the hat (Yo, y'all niggas is fucking dumb)\nThink I ain't got a trick up my motherfuckin' sleeve, you bitch-ass niggas\nFuck these niggas thinking?\nY'all niggas thinkin' I'm doing, just sittin' around doin' nothin'?\nOh my God, niggas can't be serious\n\n[Chorus]\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\n\n[Post-Chorus]\nYo, yo (Yo, yo)\nYo, yo (Yo, yo)\nYo, yo (Yo, yo, yo, yo)\n\n[Verse 1]\nMan, cats don't know (What?) what it's gon' be\nFuckin' with a nigga like me\nD to the M to the X (X)\nLast I heard, y'all niggas was havin' sex (Uh) with the same sex (Woo)\nI show no love (Yeah) to homo thugs (Nah)\nEmpty out, reload, and blow more slugs (Boom)\nHow you gonna explain fuckin' a man?\nEven if we squash the beef, I ain't touchin' your hand (Aight?)\nI don't fuck with chumps (Yeah)\nFor those that been to jail, that's the cat with the Kool-Aid on his lips and pumps (Uh)\nI don't fuck with niggas that think they broads\nOnly know how to be one way, that's the dog (Woo)\nI know how to get down, know how to bite (Bite)\nBark very little, but I know how to fight (Fight)\nI know how to chase a cat up in a tree\nMan, I'll give y'all niggas the business for fuckin' with me\nIs you crazy?\nYou might also like[Chorus]\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\n\n[Post-Chorus]\nYo, yo (Yo, yo)\nYo, yo (Yo, yo)\nYo, yo (Yo, yo, yo, yo)\n\n[Verse 2]\nOnce it's on, I come through, guns is drawn\nBlam, blam, lungs is gone, sons will mourn\nFrom dusk 'til dawn (Uh), night time belongs to the dog\nOn the street past midnight, look for 'em in the morgue (Yeah)\nWon't play with these cats 'cause I ain't got nothin' to say to these cats (Uh)\nFor the mothers that really do love 'em, please pray for these cats (Aight?)\n'Cause I know niggas is hard-headed, but I ain't got the patience (Uh)\nDon't want me havin' no patience, turn into more patients\nMore trips to ICU 'cause I see you\nTrying to get away with shit a real nigga wouldn't do\nWhere my dogs at? (Right here)\nYou see them niggas? (Right where?)\nGet 'em, boys (Right there)\nThat's how we do (Alright, then)\nYeah, this is for my dogs (Uh), this is for my dogs (Uh)\nYo, where we at, baby? (Creepin' through the fog)\nFrom then 'til now, don't ask me how\nKnow that we gon' roll like them niggas and hit every block on the job\n[Chorus]\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\n\n[Post-Chorus]\nYo, yo (Yo, yo)\nYo, yo (Yo, yo)\nYo, yo (Yo, yo, yo, yo)\n\n[Verse 3]\nI get apes doin' crime, stomp niggas like grapes makin' wine (Yeah)\nFive CD's with mad rhymes (Aight)\nDon't hit me with that positive shit, I know you lyin'\nYou really wanna stop niggas from dyin'? Stop niggas from tryin' (Yeah)\n'Cause I ain't really got that time to waste\nAnd I thought I told you to get these fuckin' bums out my face (Aight?)\nLookin' at you in your grill, it might be nice to cut (Uh-huh)\nOnce I split your ass in two, you'll be twice as butt (Uh-huh)\nYeah, you right, I know your style pussy, 'cause I'm fuckin' it (Damn)\nSince we all here, you hold my dick while he suckin' it (Woo)\nMotherfucker, don't you know you'll never come near me?\nShove your head up your ass, have you seein' shit clearly (Woo)\nNever heard that D be running (Uh), 'cause D be gunning\nI beat my dick and bust off in your eye so you can see me comin'\nEmpty clips and shells are what I leave behind\nAnd if they get me with the joint, they'll hit me with a three-to-nine\n[Chorus]\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\nWhere the hood, where the hood, where the hood at?\nHave that nigga in the cut, where the wood at?\nOh, them niggas actin' up? Where the wolves at?\nYou better bust that if you gon' pull that\n\n[Outro]\nWhat?\nWhere the fuckin' hood at?\nAyy, no one's fuckin' with me, nigga (It's all good)\nFor real (It's all good, dog is the hood)\nI am the hood (It's all good, dog in the hood)\nI am the streets (It's all good, dog is the hood)\nYou bitch-ass nigga (It's all good, dog is the hood)\nTake it how you want, motherfucker (It's all good)\nI'm in the hood all day (Dog is the hood)\nI think I'm, like, the only nigga, dog (Dog in the hood)\nThat can go to the projects (School Street, Home of the Brave)\nBy his fuckin' self and be good (Good)\nYeah, nigga, ask niggas on my projects (Yo, Y.O.)\nWhen the last time they seen dog, motherfucker (Not too long ago, baby)\nD, Y, uh (Y'all niggas is homeless)\nKato (Where the hood at?)113Embed"
    },
    {
        "artist": "DMX",
        "song name": "X Gon’ Give It to Ya",
        "text": "[Intro]\nArf-arf\nYeah, uh, yeah (Grr), yeah, uh (Grr)\nYeah, don't get it twisted\nThis rap shit is mine, motherfucker\nIt's not a fuckin' game\nFuck what you heard (Grr)\nIt's what you hearin' (It's what you hearin')\nIt's what you hearin' (Listen)\nIt's what you hearin' (Listen)\nIt's what you hearin' (Listen)\n\n[Verse 1]\nX gon' give it to ya (What?)\nFuck waitin' for you to get it on your own, X gon' deliver to ya (Uh)\nKnock-knock, open up the door, it's real\nWith the non-stop pop-pop from stainless steel\nGo hard, gettin' busy with it (Ooh)\nBut I got such a good heart that I'll make a motherfucker wonder if he did it (Yeah)\nDamn right, and I'll do it again (Yeah)\n'Cause I am light so I gots to win (Uh, uh, uh)\nBreak bread with the enemy (What?)\nNo matter how many cats I break bread with, I'll break who you sendin' me (Yeah)\nYou motherfuckers never wanted nothin' but your life saved (Uh)\nBitch, and that's on a light day (Give up)\nI'm gettin' down (Down) like a nigga said \"Freeze\" (Uh)\nBut won't be the one endin' up on his knees\nBitch please, (Come on) if the only thing you cats did\nWas came out to play, stay out my way, motherfucker\nYou might also like[Chorus]\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (What)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya\n\n[Verse 2]\nThey ain't never gave nothin' to me (Yeah)\nBut every time I turn around cats got they hands out wantin' somethin' from me (Uh-huh)\nI ain't got it, so you can't get it (Yeah)\nLet's leave it at that 'cause I ain't with it (Yeah)\nHit it with full strength (What?)\nI'm a jail nigga, so I face the world like it's Earl in the bullpen\nYou against me, me against you (Uh, uh, uh, uh)\nWhatever, whenever, nigga, fuck you gon' do?\nI'm a wolf in sheep's clothin' (What?)\nOnly nigga that you know who can chill, come back and get the streets open\nI've been doin' this for nineteen years (What?)\nNiggas wanna fight me? Fight these tears (What?)\nI put in work and it's all for the kids (Uh)\nBut these cats done forgot what work is (Uh-huh)\nThey don't know who we be, lookin'\nBut they don't know who they see, nigga\n[Chorus]\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (What)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya (Come on)\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (Come on)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya\n\n[Verse 3]\nAyo, where my niggas at?\nI know I got 'em down in the streets, give 'em love and they give it back (Ooh)\nTalk too much for too long (What?)\nDon't give up, you're too strong (What?)\nLove to the wild, wild hunnids (Yeah)\nShout out to niggas that done it (Come on)\nAnd it ain't even about the dough (Uh, uh, uh)\nIt's about gettin' down for what you stand for, yo, for real\n\n[Chorus]\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (Come on)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya (Come on)\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (Come on)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya (Come on)\nFirst, we gonna rock, then we gonna roll\nThen we let it pop, go, let it go (Come on)\nX gon' give it to ya (Uh), he gon' give it to ya\nX gon' give it to ya (Uh), he gon' give it to ya (Come on)\n[Outro]\nCome on\nUh, uh, come on121Embed"
    }
]